InformationRegisters/ххх_КодыНоменклатурыВесыКассы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ххх_КодыНоменклатурыВесыКассы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Инкримента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДляСостава</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ххх_ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДополнительныеСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеСведения</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ххх_КодыНоменклатурыВесыКассы/Ext/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	// Вставить содержимое обработчика. 
	
	Если Замещение=Ложь Тогда
		Запрос=Новый запрос;
		Запрос.УстановитьПараметр("Наб",ЭтотОбъект.Выгрузить());
		Запрос.Текст="ВЫБРАТЬ
		             |	Наб.номенклатура КАК номенклатура,
		             |	Наб.Оборудование КАК Оборудование,
		             |	Наб.код КАК код,
		             |	2 КАК Поле1
		             |ПОМЕСТИТЬ наб
		             |ИЗ
		             |	&Наб КАК Наб
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	наб.номенклатура КАК номенклатура,
		             |	наб.Оборудование КАК Оборудование,
		             |	наб.код КАК код,
		             |	2 КАК Поле1,
		             |	""На данный код зарегистрирована другая номенклатура"" КАК Сообщение
		             |ИЗ
		             |	РегистрСведений.ххх_КодыНоменклатурыВесыКассы КАК ххх_КодыНоменклатурыВесыКассы
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ наб КАК наб
		             |		ПО ххх_КодыНоменклатурыВесыКассы.Оборудование = наб.Оборудование
		             |			И ххх_КодыНоменклатурыВесыКассы.Код = наб.код
		             |			И ххх_КодыНоменклатурыВесыКассы.Номенклатура <> наб.номенклатура
		             |
		             |СГРУППИРОВАТЬ ПО
		             |	наб.номенклатура,
		             |	наб.код,
		             |	наб.Оборудование
		             |
		             |ОБЪЕДИНИТЬ ВСЕ
		             |
		             |ВЫБРАТЬ
		             |	наб.номенклатура,
		             |	NULL,
		             |	NULL,
		             |	СУММА(1),
		             |	""Данная номенклатура уже находится в матрице""
		             |ИЗ
		             |	наб КАК наб
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ххх_КодыНоменклатурыВесыКассы КАК ххх_КодыНоменклатурыВесыКассы
		             |		ПО наб.номенклатура = ххх_КодыНоменклатурыВесыКассы.Номенклатура
		             |			И наб.Оборудование = ххх_КодыНоменклатурыВесыКассы.Оборудование
		             |
		             |СГРУППИРОВАТЬ ПО
		             |	наб.номенклатура";
		Выборка=запрос.Выполнить().Выбрать();
		Пока выборка.Следующий() и выборка.Поле1>1 Цикл
			СОобщить(выборка.Сообщение);
			Отказ=истина;
		КонецЦикла;
	КонецЕсли;
	Если не Отказ Тогда
	
		номка=ЭтотОбъект.Выгрузить();
		
		Запрос=Новый запрос;
		Запрос.УстановитьПараметр("Номка",номка);
		Запрос.Текст="ВЫБРАТЬ
		             |	Номка.Номенклатура КАК Номенклатура,
		             |	Номка.Оборудование КАК Оборудование,
		             |	Номка.Код КАК Код
		             |ПОМЕСТИТЬ номка
		             |ИЗ
		             |	&Номка КАК Номка
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	номка.Номенклатура КАК Номенклатура,
		             |	ЕСТЬNULL(ххх_КодыНоменклатурыВесыКассыТекущееСостояние.Оборудование, номка.Оборудование) КАК Оборудование,
		             |	ЕСТЬNULL(ххх_КодыНоменклатурыВесыКассыТекущееСостояние.Код, номка.Код) КАК Код
		             |ИЗ
		             |	номка КАК номка
		             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ххх_КодыНоменклатурыВесыКассы КАК ххх_КодыНоменклатурыВесыКассыТекущееСостояние
		             |		ПО номка.Номенклатура = ххх_КодыНоменклатурыВесыКассыТекущееСостояние.Номенклатура
		             |
		             |СГРУППИРОВАТЬ ПО
		             |	номка.Номенклатура,
		             |	ЕСТЬNULL(ххх_КодыНоменклатурыВесыКассыТекущееСостояние.Оборудование, номка.Оборудование),
		             |	ЕСТЬNULL(ххх_КодыНоменклатурыВесыКассыТекущееСостояние.Код, номка.Код)
		             |ИТОГИ ПО
		             |	Номенклатура";
		Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);	
		СостояниеНаВесах=справочники.ххх_Справочник.СостояниеНаВесах.Значение;	
		Пока выборка.Следующий() Цикл		
			стр=РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
			стр.Объект=выборка.номенклатура;
			стр.Свойство=СостояниеНаВесах;	
			Элы=Выборка.Выбрать();
			Пока элы.Следующий() Цикл			
				стр.Значение=Строка(стр.Значение)+"("+элы.оборудование.Код+")*"+Строка(элы.Код)+"|";			
			КонецЦикла;
			УстановитьПривилегированныйРежим(Истина);
			стр.Записать(истина);	
			УстановитьПривилегированныйРежим(Ложь);
		КонецЦикла;	
	КонецЕсли;
	
	
	Если НЕ Отказ Тогда
		
		//Для каждого стр из ЭтотОбъект Цикл

//			ПланыОбмена.ЗарегистрироватьИзменения(Выборка.Ссылка, ЭтотОбъект.Отбор.Номенклатура.Значение); 	
			
			Выборка = ПланыОбмена.ПланОбменаСОборудованием.Выбрать();
			Пока Выборка.Следующий() Цикл 
				Если Выборка.Ссылка = ПланыОбмена.ПланОбменаСОборудованием.ЭтотУзел() Тогда
					Продолжить;
				КонецЕсли;
				Для каждого СтрТовар из ЭтотОбъект Цикл
					ПланыОбмена.ЗарегистрироватьИзменения(Выборка.Ссылка, СтрТовар.Номенклатура); 
				КонецЦикла;
			КонецЦикла;
			
		//КонецЦикла;
		
	КонецЕсли;

	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)

		
	Для каждого стр из ЭтотОбъект Цикл
		
		Если стр.Оборудование.type=3 и не РольДоступна("ПолныеПрава") Тогда
			
			Отказ=Истина;
			Сообщить("Нельзя менять матрицу на весах самообслуживание!");
			
		КонецЕсли;
		
		
		
	КонецЦикла;
	
	
	Если ЭтотОбъект.Отбор.Оборудование.Значение.type=3 и не РольДоступна("ПолныеПрава") и ЭтотОбъект.Количество()=0 Тогда
		
		Отказ=Истина;
		Сообщить("Нельзя менять матрицу на весах самообслуживание!");
		
	КонецЕсли;
КонецПроцедуры
